<!DOCTYPE html>
<head>
    <title>Tutorial 4 Metodolog&iacute;as del desarollo de software</title>
        <!--[if lt IE 9]>
        <script src="../js/corrector.js"></script>
        <![endif]-->
        <meta name="description" content="p&aacute;gina tutorial del tema 4.? Metodolog&iacute;as del desarollo de software para el semestre 2016-1"/>
        <meta name="keywords" content="tutorial,FI,UNAM,Metodologias,desarollo,software,2016-1,ingenieria"/>
		<meta charset="UTF-8">
		<link rel="stylesheet" type="text/css" href="../css/detalles.css" />
		<!--[if lt IE 8]>
			<link rel="stylesheet" type="text/css" href="../css/especial.css" />
		<![endif]-->
	</head>
	<body>
		<div id="header_container">  
			<div id="header">
				<div id="banner">
					<h1><span>7.3</span>Validaci&oacute;n de Sistemas Cr&iacute;ticos</h1>
				</div>
				<div id="banner_slogan">
					<h2>Ingenier&iacute;a de Software</h2>
				</div>
				<div id="menubar">
					<ul id="menu">
						<li><a href="principal.html">Inicio</a></li>
						<li CLASS="current"><a href="tutorial.html">Tutorial</a></li>
						<li><a href="cuestionario.html">Cuestionario</a></li>
						<li><a href="bibliografia.html">Bibliograf&iacute;a</a></li>
						<li><a href="video.html">Video</a></li>
						<li>
							<audio controls>
								<source src="../music/1.mp3" type="audio/mp3"/>
							</audio>
							<!--[if lt IE 9]>
								<embed autostart="false" src="../music/1.mp3" height=16 width=100></embed>
							<![endif]-->
						</li>
					</ul>
				</div>
			</div>
		</div>
		<div id="main">
			<div id="site_content">	
				<div id="content2">
					<br/><h1>Fiabilidad</h1>	

					<p class="tutorial">
						El objetivo de un sistema cr&iacute;tico es que sea lo m&aacute;s confiable posible, en otras palabras que sea fiable, seguro, est&eacute;
						disponible siempre y tenga protecci&oacute;n contra cualquier tipo de ataque. Para asegurar la confiabilidad hay que realizar varias pruebas
						para validar y verificar el sistema, la prueba se considera exitosa cuando el sistema cumple con los objetivos para la cual
						fue creada la prueba, una de las funciones principales de las pruebas es saber si est&aacute;n cumpliendo las especificaciones, ya sea
						a nivel general o &uacute;nicamente un componente, cuando se prueba un componente se dice que es una prueba unitaria.
					</p>
					<p class="tutorial">
						Validar responde a la pregunta ¿estamos construyendo el producto correcto?, mientras que la verificaci&oacute;n 
						responde a la pregunta ¿estamos construyendo el producto correctamente?, o lo que es lo mismo, validaci&oacute;n es asegurarse que el 
						producto cumple con las especificaciones del cliente, mientras que la verificaci&oacute;n se encarga de asegurar el
						funcionamiento correcto y &oacute;ptimo de las funciones implementadas ya que de esto depende el &eacute;xito o fracaso de un 
						sistema cr&iacute;tico.
					</p>
					<!--[if !IE]>
						<p>
							<img src="../images/check.jpg" style="height: 250px; width: 300px; margin-left: auto; margin-right: auto; display:block;"/>
						</p> 
					<![endif]-->
					<p class="tutorial">
						Para comprender mejor como es el estudio de la fiabilidad se debe conocer primero como es un perfil operacional, consiste en una 
						especificaci&oacute;n de entradas y la probabilidad de que ocurra cada entrada respectivamente, de esta manera las entradas que tienen la m&aacute;s 
						alta probabilidad de ocurrir se encuentran en una sola parte, mientras que cada entrada especial se encuentra por separado para 
						su estudio particular.
					</p>
					<p>
						<img src="../images/perfilOperacional.png" style="height: 400px; width: 700px; margin-left: auto; margin-right: auto; display:block;"/>
					</p>    
					<p class="tutorial">
						Para poder conocer el estado de la fiabilidad de un sistema se deben de seguir los siguientes pasos:
						<ol class="tutorialul">
							<li>Se establece un perfil operacional estudiando los sistemas existentes que sean similares al que se desea desarrollar.</li>
							<li>Se construye un conjunto de datos de prueba provenientes del perfil operacional.</li>
							<li>Se prueba el sistema con estos datos y se registra la frecuencia con la que ocurren los errores.</li>
							<li>Se calcula la fiabilidad del sistema obteniendo suficientes datos en el paso anterior para realizar un estudio estad&iacute;stico.</li>
						</ol>
					</p>
					<p class="tutorial">
						A esta forma de conocer la fiabilidad se le llama prueba estad&iacute;stica, su objetivo es medir la fiabilidad usando una gran
						cantidad de datos obtenidos con pruebas aleatorias, es lo contrario a las pruebas de defectos donde se trata de encontrar la mayor 
						cantidad de errores sin importar que tan fiable haya resultado el sistema.
					</p>
					<p class="tutorial">
						Si se aplica correctamente este m&eacute;todo se puede conocer la fiabilidad, pero en la pr&aacute;ctica es dif&iacute;cil lograr realizar bien 
						todos los pasos, esto se debe principalmente a:
						<ol class="tutorialul">
							<li>Los perfiles operacionales no son una descripci&oacute;n precisa de la utilizaci&oacute;n real del sistema, adem&aacute;s no es 
							posible tener un perfil completo ya que el sistema debe ser capaz de responder a entradas no contempladas 
							en el perfil.</li>
							<li>Los altos costos en la generaci&oacute;n de datos de prueba.</li>
							<li>La incertidumbre estad&iacute;stica cuando se busca una fiabilidad alta.</li>
						</ol>
					</p>
					<p class="tutorial">
						La incertidumbre estad&iacute;stica es un problema que siempre estar&aacute; presente en los modelos probabil&iacute;sticos, ya que obtener una
						buena predicci&oacute;n de la fiabilidad requiere provocar errores del sistema, pero los datos que obtendremos siempre ser&aacute;n una 
						muestra y no representar&aacute; todos los errores de nuestro sistema para todo instante de tiempo;
						la mejor manera de generar los datos que se usar&aacute;n en las pruebas es por medio de herramientas que generen los
						datos con las caracter&iacute;sticas que se necesitan, pero muchas veces &eacute;stas herramientas no son suficientes para generar
						los datos de los sistemas con mayor interaci&oacute;n, por lo que los datos se deben generar a mano e implica un mayor costo.
					</p>
					<p>
						<img src="../images/duda.jpg" style="height: 200px; width: 250px; margin-left: auto; margin-right: auto; display:block;"/>
					</p> 
					<p class="tutorial">
						Un sistema nunca lograr&aacute; ser 100% confiable, generalmente un sistema de alta fiabilidad debe tener un error cada 100000 a&ntilde;os, 
						el nivel de fiabilidad se debe negociar con el cliente ya que mientras m&aacute;s fiable se desea un sistema los costos y el tiempo necesario aumentan de manera no lineal. Para predecir la 
						fiabilidad se necesita tratarla como una variable de un modelo matem&aacute;tico, el modelo m&aacute;s simple de crecimiento de la fiabilidad 
						es un modelo de funci&oacute;n escalonada, en donde la fiabilidad va aumentando cada vez que se repara un error, el problema con este 
						modelo es que supone que cada error es igual de importante y que la soluci&oacute;n al error se implementa de forma correcta sin afectar
						a los dem&aacute;s componentes del sistema,  lo que ocasiona que cuando se hacen las reparaciones el ROCOF (ROCOF: Rate of OCcurrence Of 
						Failures, tasa de ocurrencia de fallos) siempre disminuye.
					</p>
					<p>
						<img src="../images/escalonada.gif" style="height: 400px; width: 700px; margin-left: auto; margin-right: auto; display:block;"/>
					</p>      
					<p class="tutorial">
						Cuando se reparan los errores comunes la fiabilidad aumenta m&aacute;s a comparaci&oacute;
						de arreglar los que ocurren menos seguido, con lo que es m&aacute;s claro porqu&eacute; el crecimiento en la fiabilidad del sistema no es 
						constante con cada error arreglado. En los modelos posteriores siempre se toma en cuenta una variable aleatoria para
						representar a los errores nuevos que se crear&aacute;n por arreglar los errores anteriores.
					</p>
					<p>
						<img src="../images/escalonada2.gif" style="height: 400px; width: 700px; margin-left: auto; margin-right: auto; display:block;"/>
					</p>      
					<P class="tutorial">
						Si se compara el avance de la fiabilidad con modelos similares se podr&iacute;a predecir la fiabilidad extrapolando los datos, aunque
						estos valores sean aproximados se puede tener una idea de como ser&aacute; el comportamiento general del sistema si no sucede algo
						que ocasione un cambio dr&aacute;stico. Mientras no se logre llegar al nivel de fiabilidad requerido las pruebas y la depuraci&oacute;n deben 
						continuar hasta ese momento, en donde las depuraciones consisten en m&aacute;s pruebas estad&iacute;sticas y en tener las especificaciones de 
						una manera formal para poder entender y arreglar los errores encontrados en las pruebas.
					</P>
					<p class="tutorial">
						Aunque no exista un modelo perfecto para obtener la fiabilidad, el modelo anterior tiene muchas ventajas, por lo que es necesario
						gastar parte de los recursos en usarlo, conocer con antelaci&oacute;n el crecimiento de la fiabilidad es &uacute;til:
						<ol class="tutorialul">
							<li>Se puede calendarizar las pruebas, con la calendarizaci&oacute;n de las pruebas se puede obtener el tiempo necesario que se le dedicara a 
							las pruebas, con &eacute;ste se puede conocer si es necesario asignar m&aacute;s recursos a la fiabilidad para entregar el proyecto en la
							fecha acordada con el cliente.</li>
							<li>Se negocian los requerimientos del sistema, si el modelo de crecimiento de la fiabilidad es lento se puede negociar con los clientes 
							&eacute;ste punto para saber si se le asignar&aacute;n m&aacute;s recursos a la fiabilidad o si se bajar&aacute; el nivel requerido de fiabilidad.</li>
						</ol>
					</p>
					<a href="metodos.html" class="button">Anterior<i class="icon-chevron-right"></i></a>
					<a href="seguridad.html" class="button">Siguiente<i class="icon-chevron-right"></i></a>
				</div> 
			</di v>
			<div id="footer_container">     
				<div id="footer">
                    <p>P&aacute;gina creada por Meza Peña Augusto en el semestre 2016-1, Facultad de Ingenier&iacute;a, UNAM.</p>
				</div>
			</div>
		</div> 
	</body>
<script src="https://cdnjs.cloudflare.com/ajax/libs/canvasjs/1.7.0/canvasjs.min.js"></script>
<link href='https://fonts.googleapis.com/css?family=Lato' rel='stylesheet' type='text/css'>
<script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.4/jquery.min.js"></script>
</html>
