<!DOCTYPE html>
	
<!-- Mirrored from mmedia1.fi-b.unam.mx/material/t2175/html/metodos.html by HTTrack Website Copier/3.x [XR&CO'2014], Sun, 25 Oct 2015 19:55:20 GMT -->
<head>
		<title>Tutorial 7.3 Validaci&oacute;n de sistemas cr&iacute;ticos</title>
		<!--[if lt IE 9]>
			<script src="../js/corrector.js"></script>
		<![endif]-->
		<meta name="description" content="p&aacute;gina tutorial del tema 7.3: Validaci&oacute;n de sistemas cr&iacute;ticos para el semestre 2015-2" />
		<meta name="keywords" content="tutorial,FI, UNAM, Validaci&oacute;n, sistemas, cr&iacute;ticos, 2015-2,ingenieria,software, facultad" />
		<meta charset="UTF-8">
		<link rel="stylesheet" type="text/css" href="../css/detalles.css" />
		<!--[if lt IE 8]>
			<link rel="stylesheet" type="text/css" href="../css/especial.css" />
		<![endif]-->
		<script type="text/javascript" src="../js/jquery.min.js"></script>
	</head>

	<body>
		<div id="header_container">  
			<div id="header">
				<div id="banner">
					<h1><span>7.3</span>Validaci&oacute;n de Sistemas Cr&iacute;ticos</h1>
				</div>
				<div id="banner_slogan">
					<h2>Ingenier&iacute;a de Software</h2>
				</div>
				<div id="menubar">
					<ul id="menu">
						<li><a href="principal.html">Inicio</a></li>
						<li CLASS="current"><a href="tutorial.html">Tutorial</a></li>
						<li><a href="cuestionario.html">Cuestionario</a></li>
						<li><a href="bibliografia.html">Bibliograf&iacute;a</a></li>
						<li><a href="video.html">Video</a></li>
						<li>
							<audio controls>
								<source src="../music/1.mp3" type="audio/mp3"/>
							</audio>
							<!--[if lt IE 9]>
								<embed autostart="false" src="../music/1.mp3" height=16 width=100></embed>
							<![endif]-->
						</li>
					</ul>
				</div>
			</div>
		</div>
		<div id="main">
			<div id="site_content">	
				<div id="content2">
					<br/><h1>M&eacute;todos formales</h1>	
					<p class="tutorial">
						Los m&eacute;todos formales son una perspectiva matem&aacute;tica para poder conocer si las especificaciones, dise&ntilde;o, codificaci&oacute;n
						y pruebas son l&oacute;gicamente correctas, lo que nos permite describir a diferentes partes y procesos del sistema en un lenguaje 
						formal sin ambig&uuml;edades y con presici&oacute;n.
					</p>
					<p class="tutorial">
						Los m&eacute;todos formales son una herramienta muy importante para poder alcanzar los objetivos de confiabilidad 
						del sistema, as&iacute; como descubrir de forma temprana si los requerimientos del sistema no tienen inconsistencias o si el 
						dise&ntilde;o es correcto, lo que nos permite identificar errores en estas etapas y ahorrar mucho tiempo y dinero al no tener 
						que regresar a etapas iniciales del proyecto.
					</p>
					<p class="tutorial">
						Los m&eacute;todos formales son m&aacute;s importante y &uacute;tiles durante dos etapas del desarrollo de un sistema:
						<ul class="tutorialul">
							<li>Las especificaciones se desarrollan y analizan para descubrir si existe alguna inconsistencia,
							con esto se puede conocer si las especificaciones est&aacute;n l&oacute;gicamente bien construidas.</li>
							<li>Durante la verificaci&oacute;n del c&oacute;digo se revisa que sea consistente con la especificaci&oacute;n del 
							proyecto. En esta etapa se pueden descubrir errores en la programaci&oacute;n y en el dise&ntilde;o.</li>
						</ul>
					</p>
					<p class="tutorial">
						Para usar los m&eacute;todos formales como forma de verificaci&oacute;n de un sistema requiere de gran cantidad de recursos y herramientas,
						adem&aacute;s de tener que contratar personal experto en el tema y asegurar que no existan errores durante el m&eacute;todo, pero por la
						naturaleza de los sistemas cr&iacute;ticos es preferible usar gran cantidad de los recursos en este tipo de pruebas y evitar a toda
						costa cualquier error.
					</p>
					<p>
						<img src="../images/inconsistencia.jpg" style="height: 250px; width: 300px; margin-left: auto; margin-right: auto; display:block;"/>
					</p> 
					<p class="tutorial">
						Aunque los m&eacute;todos formales sean de gran utilidad al desarrollar sistemas cr&iacute;ticos, &eacute;stos, como todos los m&eacute;todos, tienen
						algunas desventajas:
						<ul class="tutorialul">
							<li>S&oacute;lo verifican que no existan inconsistencias en los requerimientos, pero no es posible saber si los 
							requerimientos est&aacute;n completos o si de verdad es lo que el cliente desea que haga el sistema.</li>
							<li>Existe la posibilidad de cometer errores, ya que se complican mucho conforme el sistema va creciendo.</li>
							<li>Las pruebas pueden asumir un patr&oacute;n diferente de uso, con lo que todas las pruebas realizadas sobre el sistema no ser&aacute;n
							de ninguna manera 100% acertadas.</li>
						</ul>
					</p>
					<p class="tutorial">
						A pesar de las desventajas, los m&eacute;todos formales son la mejor manera de poder encontrar errores en las especificaciones,
						 las especificaciones son las causantes de una gran cantidad de errores en los sistemas cr&iacute;ticos, por lo que es
						preferible gastar recursos en verificar el sistema con m&eacute;todos formales a enfrentarse a un problema futuro cuando 
						el sistema est&eacute; en funcionamiento.
					</p>
				</div>
				<a href="fiabilidad.html" class="button">Siguiente<i class="icon-chevron-right"></i></a>
			</div> 
		</div>
		<div id="footer_container">     
			<div id="footer">
				<p>P&aacute;gina creada por Guillermo P&eacute;rez Villarreal en el semestre 2015-2, Facultad de Ingenier&iacute;a, UNAM.</p>
			</div>
		</div> 
	</body>

<!-- Mirrored from mmedia1.fi-b.unam.mx/material/t2175/html/metodos.html by HTTrack Website Copier/3.x [XR&CO'2014], Sun, 25 Oct 2015 19:55:20 GMT -->
</html>
