<!DOCTYPE html>
	
<!-- Mirrored from mmedia1.fi-b.unam.mx/material/t2175/html/seguridad.html by HTTrack Website Copier/3.x [XR&CO'2014], Sun, 25 Oct 2015 19:55:43 GMT -->
<head>
		<title>Tutorial 7.3 Validaci&oacute;n de sistemas cr&iacute;ticos</title>
		<!--[if lt IE 9]>
			<script src="../js/corrector.js"></script>
		<![endif]-->
		<meta name="description" content="p&aacute;gina tutorial del tema 7.3: Validaci&oacute;n de sistemas cr&iacute;ticos para el semestre 2015-2" />
		<meta name="keywords" content="tutorial,FI, UNAM, Validaci&oacute;n, sistemas, cr&iacute;ticos, 2015-2,ingenieria,software, facultad" />
		<meta charset="UTF-8">
		<link rel="stylesheet" type="text/css" href="../css/detalles.css" />
		<!--[if lt IE 8]>
			<link rel="stylesheet" type="text/css" href="../css/especial.css" />
		<![endif]-->
		<script type="text/javascript" src="../js/jquery.min.js"></script>
	</head>

	<body>
		<div id="header_container">  
			<div id="header">
				<div id="banner">
					<h1><span>7.3</span>Validaci&oacute;n de Sistemas Cr&iacute;ticos</h1>
				</div>
				<div id="banner_slogan">
					<h2>Ingenier&iacute;a de Software</h2>
				</div>
				<div id="menubar">
					<ul id="menu">
					  <li><a href="principal.html">Inicio</a></li>
					  <li CLASS="current"><a href="tutorial.html">Tutorial</a></li>
					  <li><a href="cuestionario.html">Cuestionario</a></li>
					  <li><a href="bibliografia.html">Bibliograf&iacute;a</a></li>
					  <li><a href="video.html">Video</a></li>
					  <li>
						<audio controls>
						  <source src="../music/1.mp3" type="audio/mp3"/>
						</audio>
						<!--[if lt IE 9]>
							<embed autostart="false" src="../music/1.mp3" height=16 width=100></embed>
						<![endif]-->
					  </li>
					</ul>
				</div>
			</div>
		</div>
		<div id="main">
			<div id="site_content">	
				<div id="content2">
					<br/><h1>Seguridad</h1>	
					<p class="tutorial">
						Un problema al intentar saber con precisi&oacute;n el nivel de seguridad de nuestro sistema es que no es posible representar la seguridad
						de manera cuantitativa, solo se le puede clasificar desde "muy baja" hasta "muy alta" y la clasificaci&oacute;n se le
						asignar&aacute; con base a la experiencia de los desarrolladores.
					</p>
					<p class="tutorial">
						Las revisiones de los sistemas de seguridad cr&iacute;tica es de vital importancia, las pruebas estad&iacute;sticas
						no son suficientes para asegurar el buen funcionamiento y la seguridad de nuestro sistema, por eso se deben de realizar 
						las siguientes 5 revisiones al validar y verificar la seguridad del sistema:
						<ol class="tutorialul">
							<li> Revisi&oacute;n para lograr una estructura sustentable.</li>
							<li> Revisi&oacute;n para verificar que el dise&ntilde;o de los algoritmos y estructuras de datos sean consistentes
							con el comportamiento que se requiere.</li>
							<li> Revisi&oacute;n de los algoritmos y estructuras de datos.</li>
							<li> Revisi&oacute;n de los casos de prueba del sistema.</li>
							<li> Revisar que las funciones creadas sean las que se planearon.</li>
						</ol>
					</p>	
					<p class="tutorial">
						Para poder probar la seguridad del sistema la prueba por contradicci&oacute;n es la m&aacute;s efectiva. Se realiza suponiendo que se puede
						alcanzar un estado inseguro durante la ejecuci&oacute;n del programa, para demostrar que no es posible, con ayuda del c&oacute;digo se 
						debe concluir que si se tienen las condiciones necesarias para que ocurra un caso de peligro entonces las condiciones de terminaci&oacute;n
						no ser&aacute;n consistentes. Esto se repite para todos los casos detectados en los que pueda haber errores o alg&uacute;n tipo de peligro.
					</p>
					<p>
							<img src="../images/contradiccion.jpg" style="height: 200px; width: 350px; margin-left: auto; margin-right: auto; display:block;"/>
					</p> 
					<p class="tutorial">
						En los sistemas de seguridad cr&iacute;ticos hay dos razones por la cual se debe prestar m&aacute;s atenci&oacute;n a la calidad:
						<ol class="tutorialul">
							<li>Los accidentes son hechos raros en los sistemas cr&iacute;ticos y es imposible simularlos durante las pruebas del sistema.</li>
							<li>Los requerimientos de seguridad son requerimientos que no contemplan el comportamiento del sistema si llega a un estado 
								inseguro.</li>
						</ol>
					</p>	
					<p class="tutorial">
						El desarrollo de sistemas de seguridad cr&iacute;ticos debe seguir un modelo de ciclo de vida para desarrollarse, el cual consiste en 
						los siguientes pasos:
						<ol class="tutorialul">
							<li>La creaci&oacute;n de un registro de peligros y de supervisi&oacute;n del sistema.</li>
							<li>Designaci&oacute;n de personal espec&iacute;fico en la seguridad.</li>
							<li>La utilizaci&oacute;n extensiva de revisiones de seguridad durante el proceso de desarrollo.</li>
							<li>La creaci&oacute;n de un sistema de certificaci&oacute;n de seguridad en el cual los componentes de seguridad cr&iacute;ticos se certifican 
								por medio de la evaluaci&oacute;n de su seguridad.</li>
							<li>Hacer una documentaci&oacute;n que solo se dedique a la configuraci&oacute;n del sistema, siempre complementada por la documentaci&oacute;n 
							    t&eacute;cnica.</li>
						</ol>
					</p>
					<p class="tutorial">
						Los encargados de la seguridad del sistema deben ser claramente identificados por todos los involucrados en el sistema. El ingeniero encargado de la 
						seguridad debe tener exclusivamente esa responsabilidad, no se debe involucrar en el desarrollo del sistema, su trabajo es revisar que todo
						lo relacionado con la seguridad sea implementado de manera correcta y sea documentada en su totalidad.
					</p>
					<p class="tutorial">
						Es necesario que el sistema pueda asegurar su funcionamiento en caso de que suceda alg&uacute;n evento imprevisto, gran parte de la
						seguridad se debe concentrar en sus validaciones en tiempo de ejecuci&oacute;n. Las aserciones entran en juego aqu&iacute; porque se debe
						asegurar que no es posible llegar a un estado de peligro bajo ning&uacute;n motivo, los sistemas cr&iacute;ticos deben tener implementados
						varios planes de contingencia los cuales sirven para que el sistema sepa como actuar en caso de un error, estos planes deben
						de probarse exhaustivamente porque son recursos que entran en juego en momentos cr&iacute;ticos.
					</p>
					<p>
							<img src="../images/planes.jpg" style="height: 200px; width: 350px; margin-left: auto; margin-right: auto; display:block;"/>
					</p> 
					<a href="fiabilidad.html" class="button">Anterior<i class="icon-chevron-right"></i></a>
					<a href="proteccion.html" class="button">Siguiente<i class="icon-chevron-right"></i></a>
				</div> 
			</div>
			<div id="footer_container">     
				<div id="footer">
					<p>P&aacute;gina creada por Guillermo P&eacute;rez Villarreal en el semestre 2015-2, Facultad de Ingenier&iacute;a, UNAM.</p>
				</div>
			</div> 
		</div>
	</body>

<!-- Mirrored from mmedia1.fi-b.unam.mx/material/t2175/html/seguridad.html by HTTrack Website Copier/3.x [XR&CO'2014], Sun, 25 Oct 2015 19:55:47 GMT -->
</html>
